###                                     PROJECT DATA JOB SALARIES

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
salaries = pd.read_csv(r'E:\Project\Project 2 - Job DA\salaries.csv')

In [3]:
salaries

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Business Intelligence Engineer,202800,USD,202800,US,0,US,L
1,2023,SE,FT,Business Intelligence Engineer,104300,USD,104300,US,0,US,L
2,2023,MI,FT,Data Manager,60000,GBP,73824,GB,0,GB,M
3,2023,MI,FT,Data Manager,55000,GBP,67672,GB,0,GB,M
4,2023,SE,FT,Data Scientist,290000,USD,290000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
7969,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
7970,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
7971,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
7972,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
7973,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [5]:
# work_year
# experience year: EN: Entry-level/ Junior, MI: Mid-level/ Intermediate, SE: Senior-level / Expert, EX: Executive-level / Director
# employment_type: Part-time: PT, Full-time: FT, Contract: CT, Freelance: FL
# job_title
# salary
# salary_currency 
# salary_in_usd
# employee_residence: 
# remote_ratio: 0: No remote work (less than 20%), 50: Partially remote/hybrid, 100: Fully remote (more than 80%)
# company_location: 
# company_size: S: less than 50 employees (small), M: 50 to 250 employees (medium), L: more than 250 employees (large)

In [7]:
# Shape of table
print(salaries.shape)

(7974, 11)

In [6]:
# Info of table
salaries.info

<bound method DataFrame.info of       work_year experience_level employment_type  \
0          2023               SE              FT
1          2023               SE              FT
2          2023               MI              FT
3          2023               MI              FT
4          2023               SE              FT
...         ...              ...             ...
7969       2020               SE              FT
7970       2021               MI              FT
7971       2020               EN              FT
7972       2020               EN              CT
7973       2021               SE              FT

                           job_title   salary salary_currency  salary_in_usd  \
0     Business Intelligence Engineer   202800             USD         202800
1     Business Intelligence Engineer   104300             USD         104300
2                       Data Manager    60000             GBP          73824
3                       Data Manager    55000             GBP          67672
4                     Data Scientist   290000             USD         290000
...                              ...      ...             ...            ...
7969                  Data Scientist   412000             USD         412000
7970        Principal Data Scientist   151000             USD         151000
7971                  Data Scientist   105000             USD         105000
7972           Business Data Analyst   100000             USD         100000
7973            Data Science Manager  7000000             INR          94665

     employee_residence  remote_ratio company_location company_size
0                    US             0               US            L
1                    US             0               US            L
2                    GB             0               GB            M
3                    GB             0               GB            M
4                    US             0               US            M
...                 ...           ...              ...          ...
7969                 US           100               US            L
7970                 US           100               US            L
7971                 US           100               US            S
7972                 US           100               US            L
7973                 IN            50               IN            L

[7974 rows x 11 columns]>

In [7]:
# Find NA and missing value
salaries.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

### Theo hướng tổng quan

In [11]:
# Group by work_year, count experience_level = EN, SE, EX
salaries.groupby('work_year')['experience_level'].apply(lambda x: (x=='EN').sum()).reset_index(name='count_experience_level_EN')

   work_year  count_experience_level_EN
0       2020                         21
1       2021                         46
2       2022                        115
3       2023                        247

In [12]:
# Group by work_year, count experience_level = EN, SE, EX
salaries.groupby('work_year')['experience_level'].apply(lambda x: (x=='SE').sum()).reset_index(name='count_experience_level_SE')

   work_year  count_experience_level_SE
0       2020                         19
1       2021                         75
2       2022                       1136
3       2023                       4524

In [13]:
# Group by work_year, count experience_level = EN, SE, EX
salaries.groupby('work_year')['experience_level'].apply(lambda x: (x=='EX').sum()).reset_index(name='count_experience_level_EX')

   work_year  count_experience_level_EX
0       2020                          4
1       2021                         10
2       2022                         41
3       2023                        190

In [4]:
# Group by work_year, count experience_level = EN, SE, EX
salaries.groupby('work_year')['experience_level'].apply(lambda x: (x=='MI').sum()).reset_index(name='count_experience_level_MI')

   work_year  count_experience_level_MI
0       2020                         31
1       2021                         87
2       2022                        358
3       2023                       1070

### -------------------------------------------------------------------------------------------------------------------------

In [21]:
# Group by work_year, count experience_type = FT, PT, CT, FL
salaries.groupby('work_year')['employment_type'].apply(lambda x: (x=='FT').sum()).reset_index(name='count_experience_employment_type_FT')

   work_year  count_experience_employment_type_FT
0       2020                                   69
1       2021                                  208
2       2022                                 1636
3       2023                                 6019

In [22]:
# Group by work_year, count experience_type = FT, PT, CT, FL
salaries.groupby('work_year')['employment_type'].apply(lambda x: (x=='PT').sum()).reset_index(name='count_experience_employment_type_PT')

   work_year  count_experience_employment_type_PT
0       2020                                    2
1       2021                                    4
2       2022                                    6
3       2023                                    1

In [23]:
# Group by work_year, count experience_type = FT, PT, CT, FL
salaries.groupby('work_year')['employment_type'].apply(lambda x: (x=='CT').sum()).reset_index(name='count_experience_employment_type_CT')

   work_year  count_experience_employment_type_CT
0       2020                                    3
1       2021                                    3
2       2022                                    4
3       2023                                    8

In [24]:
# Group by work_year, count experience_type = FT, PT, CT, FL
salaries.groupby('work_year')['employment_type'].apply(lambda x: (x=='FL').sum()).reset_index(name='count_experience_employment_type_FL')

   work_year  count_experience_employment_type_FL
0       2020                                    1
1       2021                                    3
2       2022                                    4
3       2023                                    3

### -------------------------------------------------------------------------------------------------------------------------

In [29]:
# Number of employee by job_title
employee_count_by_jobtitle = salaries['job_title'].value_counts()
print(employee_count_by_jobtitle)

Data Engineer                1888
Data Scientist               1688
Data Analyst                 1188
Machine Learning Engineer     816
Applied Scientist             226
                             ...
Sales Data Analyst              1
Data Quality Engineer           1
Deep Learning Researcher        1
Data DevOps Engineer            1
Manager Data Management         1
Name: job_title, Length: 118, dtype: int64

### -------------------------------------------------------------------------------------------------------------------------------------

In [21]:
# Group by job title , Average salary
salaries_groupby_jobtitle = salaries.groupby('job_title')['salary_in_usd'].mean().round(1).reset_index().rename(columns={'salary_in_usd': 'mean_job_title'})
salaries_groupby_jobtitle

                           job_title  mean_job_title
0                       AI Architect        255193.6
1                       AI Developer        141041.7
2                        AI Engineer        176925.7
3                      AI Programmer         68817.4
4               AI Research Engineer         70117.0
..                               ...             ...
113               Sales Data Analyst         60000.0
114           Software Data Engineer        111627.7
115               Staff Data Analyst         79917.0
116             Staff Data Scientist        134500.0
117  Staff Machine Learning Engineer        185000.0

[118 rows x 2 columns]

In [23]:
# Arrange descending
salaries_groupby_jobtitle = (salaries_groupby_jobtitle.sort_values(by='mean_job_title', ascending=False).reset_index(drop=True))
salaries_groupby_jobtitle

                          job_title  mean_job_title
0     Analytics Engineering Manager        399880.0
1            Data Science Tech Lead        375000.0
2    Managing Director Data Science        300000.0
3                AWS Data Architect        258000.0
4                      AI Architect        255193.6
..                              ...             ...
113            Data DevOps Engineer         53984.0
114                 Insight Analyst         47673.9
115         Compliance Data Analyst         45000.0
116        Principal Data Architect         38154.0
117           Data Quality Engineer         23753.0

[118 rows x 2 columns]

In [24]:
# Use value_counts to count in column 'remote' by year
remote_counts = salaries.groupby('work_year')['remote_ratio'].value_counts().unstack(fill_value=0)

# Add value 0, 50, 100 in DataFrame if they did't exist
if 0 not in remote_counts.columns:
    remote_counts[0] = 0
if 50 not in remote_counts.columns:
    remote_counts[50] = 0
if 100 not in remote_counts.columns:
    remote_counts[100] = 0

# Print
print(remote_counts)

remote_ratio   0    50    100
work_year
2020            18   21    36
2021            29   73   116
2022           709   61   880
2023          3925   61  2045

In [33]:
# Use value_counts to count value in 'remote' column by year
company_counts = salaries.groupby('work_year')['company_size'].value_counts().unstack(fill_value=0)

# Add value S, M, L in DataFrame if they didn't exist
if 'S' not in company_counts.columns:
    company_counts[S] = S
if 'M' not in company_counts.columns:
    company_counts[M] = S
if 'L' not in company_counts.columns:
    company_counts[L] = S

# Print
print(company_counts)

company_size    L     M   S
work_year
2020           34    17  24
2021          124    52  42
2022          191  1410  49
2023          351  5629  51

In [12]:
# Filter job_title = 'Data Analyst'
data_analyst_counts = salaries[salaries['job_title'] == 'Data Analyst']

# Group by work_year và count Data Analyst
DA_counts = data_analyst_counts.groupby('work_year').size().reset_index(name='count DA')
DA_counts

   work_year  count DA
0       2020         6
1       2021        20
2       2022       272
3       2023       890

In [17]:
## Filter job_title = 'Data Analyst'
data_analyst_salaries = salaries[salaries['job_title'] == 'Data Analyst']

# Group by work_year and calculate average (salary_in_usd)
salaries_groupby_DA = data_analyst_salaries.groupby('work_year')['salary_in_usd'].mean().round().reset_index(name='Average DA')
salaries_groupby_DA

   work_year  Average DA
0       2020     60911.0
1       2021     78258.0
2       2022    108658.0
3       2023    111341.0

In [28]:
## Filter job_title = 'Data Analyst' and employee_residence = 'US'
data_analyst_salaries_VN = salaries[(salaries['job_title'] == 'Data Analyst') & (salaries['employee_residence'] == 'US')]

# Group by work_year, employee_residence = 'US' and calculate average (salary_in_usd) 
salaries_groupby_DA_VN = data_analyst_salaries_VN.groupby('work_year')['salary_in_usd'].mean().round(1).reset_index(name='Average DA_US')
salaries_groupby_DA_VN

   work_year  Average DA_US
0       2020        82666.7
1       2021        94166.7
2       2022       115916.5
3       2023       114989.8